app/Models/M_Transaksi.php

SELECT *
FROM `tbl_transaksi_temp`
LEFT JOIN `tbl_produk` ON `tbl_produk`.`id_produk` = `tbl_transaksi_temp`.`id_produk`
LEFT JOIN `tbl_user` ON `tbl_user`.`id_user` = `tbl_transaksi_temp`.`id_user`
WHERE sha1(id_transaksi) = 'd590f578dee0cb3449c51eab4ca83f2aec7e5b26'
ORDER BY `tbl_transaksi_temp`.`id_produk` ASC
---
   public function getDataTempJoin($where = false)
    {
        if ($where === false) {
            $builder = $this->db->table($this->tableTemp);
            $builder->select('*');
            $builder->join('tbl_produk', 'tbl_produk.id_produk = tbl_transaksi_temp.id_produk', 'LEFT');
            $builder->join('tbl_user', 'tbl_user.id_user = tbl_transaksi_temp.id_user', 'LEFT');
            $builder->orderBy('tbl_transaksi_temp.id_produk','ASC');
            return $query = $builder->get();
         } else {
            $builder = $this->db->table($this->tableTemp);
            $builder->select('*');
            $builder->where($where);
            $builder->join('tbl_produk', 'tbl_produk.id_produk = tbl_transaksi_temp.id_produk', 'LEFT');
            $builder->join('tbl_user', 'tbl_user.id_user = tbl_transaksi_temp.id_user', 'LEFT');
            $builder->orderBy('tbl_transaksi_temp.id_produk','ASC');
            return $query = $builder->get();