app/Models/M_User.php

      public function getDataUser($where = false)
      {
        if ($where === false) {
            $builder = $this->db->table($this->table);
            $builder->select('*');
            $builder->orderBy('id_user','ASC');
            return $query = $builder->get();
        } else {
            $builder = $this->db->table($this->table);
            $builder->select('*');
            $builder->where($where);
            $builder->orderBy('id_user','ASC');
            return $query = $builder->get();
---
SELECT *
FROM `tbl_user`
WHERE `id_user` = 'USR2406199001'
ORDER BY `id_user` ASC

    public function getNotif($where = false)
      {
        if ($where === false) {
            $builder = $this->db->table($this->tableNotif);
            $builder->select('*');
            $builder->orderBy('id_user','ASC');
            return $query = $builder->get();
        } else {
            $builder = $this->db->table($this->tableNotif);
            $builder->select('*');
            $builder->where($where);
            $builder->orderBy('id_user','ASC');
            return $query = $builder->get();
---
SELECT *
FROM `tbl_notif`
WHERE `id_user` = 'USR2406199001'
ORDER BY `id_user` ASC